In [24]:
import numpy as np
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

titanic.groupby('sex')[['survived']].mean()
#  Example using groupby()
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()
# Example using pivot table
titanic.pivot_table('survived', index='sex', columns='class')

age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'], fill_value='none')

titanic.pivot_table(index='sex', columns=['class'], aggfunc={'survived': sum, 'fare': 'mean'})

titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838